# Essentials
tap "homebrew/cask"
tap "homebrew/cask-drivers"
brew "whalebrew"
brew "mas"

# Interpreter Toolchains
brew "yarn"
brew "deno"
brew "nodejs"
brew "elixir"
brew "erlang"
brew "poetry"
brew "ruby"
brew "php"
brew "texlive"
brew "go"
mas "xcode", id: 497799835

# Source control
brew "darcs"
brew "mercurial"
brew "subversion"
cask "github"

# Native Toolchains
brew "rustup"
brew "llvm"
brew "make"
cask "cmake"

# Cloud
brew "terraform"
brew "kn"
brew "istioctl"
brew "awscli"
brew "azure-cli"
brew "gh"
cask "google-cloud-sdk"
brew "cloudflared"

# Python
brew "pipx"
brew "black"

# Development Enviroment
brew "vim"
cask "visual-studio-code"
cask "dbeaver-community"
cask "jetbrains-toolbox"
cask "blender"
cask "raspberry-pi-imager"

# Brew virtualization
brew "lima"
brew "qemu"
brew "ko"
cask "docker"
cask "multipass"

# Multimedia
cask "mpv"

# Browser
cask "brave-browser-dev"
cask "google-chrome-dev"
cask "firefox-developer-edition"
cask "microsoft-edge"

# Communcation
cask "signal"
cask "zoom"
cask "microsoft-teams"
cask "workplace-chat"
mas "slack", id: 803453959

# Data storage
brew "syncthing"
cask "google-drive"
cask "transmission"

# Office
cask "chrome-remote-desktop-host"
cask "microsoft-remote-desktop"
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694

# Utils
brew "openssh"
brew "unzip"
brew "htop"
brew "yq"
brew "zip"
brew "curl"
brew "wget"
brew "daemonize"
cask "iterm2"
cask "cloudflare-warp"
cask "android-file-transfer"
cask "the-unarchiver"
cask "appcleaner"
cask "wacom-tablet"
cask "yubico-yubikey-manager"
