# Essentials
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
brew 'mas'
brew 'bash'
brew 'zsh'
brew 'gpatch'
brew 'make'
brew 'bzip2'
brew 'graphviz'
brew 'rsync'
brew 'wget'
brew 'curl'
brew 'watch'
brew 'openssl@3'

# Data
brew 'python@3.10'
brew 'python@3.9'
brew 'python@3.8'
brew 'poetry'
brew 'sphinx'
brew 'pipx'
brew 'black'
brew 'sqlfluff'
brew 'huggingface-cli'
cask 'anaconda'

# Java
brew 'gradle'
brew 'coursier'
cask 'temurin'

# JavaScript
brew 'nvm'
brew 'node'
brew 'yarn'

# Beam
brew 'erlang'
brew 'elixir'

# LaTeX
brew 'texlive'

# Native Toolchains
brew 'rustup-init'
brew 'ccache'
brew 'ninja'
brew 'clang-format'
brew 'libomp'
brew 'bazelisk'
cask 'cmake'
mas 'xcode', id: 497_799_835

# Development Enviroment
cask 'android-studio'
cask 'visual-studio-code'
cask 'dbeaver-community'
cask 'jetbrains-toolbox'
cask 'raspberry-pi-imager'

# Cloud
brew 'awscli'
brew 'azure-cli'
brew 'terraform'
brew 'minikube'
brew 'kustomize'
brew 'skaffold'
brew 'glab'
brew 'cloudflared'
brew 'darcs'
brew 'gh'
brew 'subversion'
cask 'github'
cask 'google-cloud-sdk'
cask 'rancher'

# Brew virtualization
cask 'utm'

# Multimedia
cask 'mpv'

# Browser
cask 'brave-browser-dev'
cask 'google-chrome-dev'
cask 'firefox-developer-edition'
cask 'microsoft-edge-dev'

# Communcation
cask 'signal'
cask 'zoom'
cask 'microsoft-teams'
cask 'workplace-chat'
mas 'slack', id: 803_453_959

# Data Sync
brew 'syncthing'
cask 'google-drive'
cask 'transmission'

# Office
cask 'chrome-remote-desktop-host'
cask 'microsoft-remote-desktop'
mas 'Pages', id: 409_201_541
mas 'Numbers', id: 409_203_825
mas 'Keynote', id: 409_183_694

# Productivity
cask 'rectangle'
mas 'Amphetamine', id: 937_984_704

# Utils
cask 'xquartz'
cask 'obs'
cask 'google-drive'
cask 'zerotier-one'

# System
cask 'fujifilm-x-webcam'
cask 'android-file-transfer'
cask 'the-unarchiver'
cask 'appcleaner'
