# Essentials
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
brew 'whalebrew'
brew 'mas'

# Interpreter Toolchains
brew 'nodejs'
brew 'python'
brew 'openjdk'

# Source control
brew 'darcs'
brew 'mercurial'
brew 'subversion'
cask 'github'

# Native Toolchains
brew 'rustup'
brew 'llvm'
brew 'make'
cask 'cmake'
mas 'xcode', id: 497_799_835

# Cloud
brew 'awscli'
brew 'azure-cli'
brew 'gh'
brew 'cloudflared'
cask 'google-cloud-sdk'

# Python
brew 'pipx'
brew 'black'

# Development Enviroment
brew 'neovim'
cask 'visual-studio-code'
cask 'dbeaver-community'
cask 'jetbrains-toolbox'
cask 'raspberry-pi-imager'

# Brew virtualization
cask 'utm'
cask 'docker'

# Multimedia
cask 'mpv'

# Browser
cask 'brave-browser-dev'
cask 'google-chrome-dev'
cask 'firefox-developer-edition'
cask 'microsoft-edge'

# Communcation
cask 'signal'
cask 'zoom'
cask 'microsoft-teams'
cask 'workplace-chat'
mas 'slack', id: 803_453_959

# Data storage
brew 'syncthing'
cask 'google-drive'
cask 'transmission'

# Office
cask 'chrome-remote-desktop-host'
cask 'microsoft-remote-desktop'
mas 'Pages', id: 409_201_541
mas 'Numbers', id: 409_203_825
mas 'Keynote', id: 409_183_694

# Art
cask 'blender'
cask 'figma'

# Productivity
cask 'rectangle'
mas 'Amphetamine', id: 937_984_704

# Utils
brew 'openssh'
brew 'gnupg'
brew 'htop'
brew 'yq'
brew 'curl'
brew 'wget'
cask 'xquartz'
cask 'iterm2'

# System
cask 'cloudflare-warp'
cask 'android-file-transfer'
cask 'the-unarchiver'
cask 'appcleaner'
cask 'wacom-tablet'
cask 'yubico-yubikey-manager'
